import pandas as pd

# набір інструментів, що дозволяє проводити маніпуляції з даними, представленими у вигляді часових рядів.

date = pd.Timestamp("2021-09-10")

print(date)# 2021-09-10 00:00:00



date1 = pd.to_datetime("2021-09-10 2:54:13")

print(date1)# 2021-09-10 2:54:1



date = pd.date_range(start='2021-09-01', freq='D', periods=8)

temperature = pd.Series([23, 17, 17, 16, 15, 14, 17, 20], index=date)

print(temperature)

data = {
   'Місто': ['Київ', 'Львів', 'Одеса', 'Харків', None, 'Львів'],
   'Температура': [25, 32, None, 24, 23, 32],
   'Вологість': ['60%', '70%', '65%', '55%', None, '70%'],
   'Дата': ['2021-08-01', '2021-08-01', '2021-08-02', '2021-08-02', '2021-08-03', '2021-08-01']
}
df = pd.DataFrame(data)

print(df)

# видалення дублікатів
df = df.drop_duplicates(subset=['Місто', 'Дата'], inplace=True)

# Для "Місто" видаляємо рядки з відсутніми значеннями.
# Для "Температура" заповнюємо відсутні дані середнім значенням температури.
df = df.dropna(subset=['Місто'], inplace=True)
df['Температура'] = df['Температура'].fillna(df['Температура'].mean())

# "Вологість" конвертуємо в число, видаливши знак відсотка та конвертуємо "Дата" в об'єкт datetime.
df['Вологість'] = df['Вологість'].str.rstrip('%').astype('float') / 100
df['Дата'] = pd.to_datetime(df['Дата'])

