import pandas as pd
import numpy as np

tables = pd.read_html("https://uk.wikipedia.org/wiki/%D0%9D%D0%B0%D1%81%D0%B5%D0%BB%D0%B5%D0%BD%D0%BD%D1%8F_%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%B8#%D0%9D%D0%B0%D1%80%D0%BE%D0%B4%D0%B6%D1%83%D0%B2%D0%B0%D0%BD%D1%96%D1%81%D1%82%D1%8C")
table = tables[12]

print(table)

# Вивести перші рядки таблиці за допомогою методу head
table.head()
print(table.head())
# Визначте кількість рядків та стовпців у датафреймі (атрибут shape)
table.shape()
print(table.shape())
# Замініть у таблиці значення "—" на значення NaN
table = table.replace("—", np.nan)
table.head()
# Визначте типи всіх стовпців за допомогою dataframe.dtypes

table.dtypes

# Замініть типи нечислових колонок на числові. Підказка - це колонки, де знаходився символ "—"
# Порахуйте, яка частка пропусків міститься в кожній колонці (використовуйте методи isnull та sum)
# Видаліть з таблиці дані по всій країні, останній рядок таблиці
# Замініть відсутні дані в стовпцях середніми значеннями цих стовпців (метод fillna)
# Отримайте список регіонів, де рівень народжуваності у 2019 році був вищим за середній по Україні
# У якому регіоні була найвища народжуваність у 2014 році?
# Побудуйте стовпчикову діаграму народжуваності по регіонах у 2019 році